{
    "texts": [
      {
        "id": "welcomeTitle",
        "languages": {
          "spanish": "Hola Soy Orlando",
          "english": "Hello, I'm Orlando"
        }
      },
      {
        "id": "welcomeDescription",
        "languages": {
          "spanish": "Soy un desarrollador Full Stack apasionado por la creación de soluciones innovadoras y funcionales que impulsen el éxito de las empresas. Con más de dos años de experiencia en el desarrollo web, he trabajado con tecnologías líderes como Java y NodeJS, y frameworks modernos como Next.js y NestJS, diseñando aplicaciones escalables y de alto rendimiento. Mi conocimiento en AWS me ha permitido implementar y gestionar proyectos tanto personales como corporativos, optimizando la infraestructura para maximizar resultados. Me destaco por mi capacidad para combinar la creatividad en el Frontend con la robustez en el Backend, creando interfaces atractivas y experiencias de usuario fluidas. Mi enfoque está en mantenerme a la vanguardia tecnológica, aprendiendo y adaptándome constantemente a las necesidades del mercado. ¿Qué aporto? Soluciones personalizadas, eficiencia en la entrega y un compromiso inquebrantable con la excelencia. Si buscas un desarrollador que no solo domine las tecnologías, sino que también entienda cómo estas generan impacto real en tu negocio, soy la persona indicada.",
          "english": "I am a Full Stack developer passionate about creating innovative and functional solutions that drive business success. With over two years of experience in web development, I have worked with leading technologies like Java and NodeJS, and modern frameworks like Next.js and NestJS, designing scalable and high-performance applications. My expertise in AWS has enabled me to deploy and manage both personal and corporate projects, optimizing infrastructure to maximize results. I excel at combining creativity in Frontend development with Backend robustness, delivering attractive interfaces and seamless user experiences. My focus is on staying at the forefront of technology, continuously learning and adapting to market demands. What do I bring? Tailored solutions, efficient delivery, and an unwavering commitment to excellence. If you're looking for a developer who not only masters the technologies but also understands how they create real impact for your business, I am the right fit."
        }
      },
      
      {
        "id": "aboutMeTitle",
        "languages": {
          "spanish": "Sobre mí",
          "english": "About Me"
        }
      },
      {
        "id": "aboutMeDescription",
        "languages": {
          "spanish": "Soy estudiante de Informática Empresarial en la Universidad de Costa Rica, donde he tenido la oportunidad de desarrollar proyectos que destacan en mi portafolio profesional. Además, he complementado mi formación académica con cursos especializados en plataformas como Udemy, lo que me ha permitido ampliar mis conocimientos y estar siempre al día con las últimas tendencias tecnológicas. Mi pasión por la informática y la programación me lleva constantemente a explorar nuevas áreas, destacándome especialmente en el desarrollo Frontend y la Ciberseguridad. Poseo experiencia práctica en múltiples tecnologías y lenguajes, incluyendo JavaScript, Java, HTML, CSS, React, Ruby on Rails, SQL y PostgreSQL. Estas habilidades han sido fortalecidas a través de proyectos personales y una práctica empresarial, donde he contribuido activamente a la creación de soluciones tecnológicas innovadoras y funcionales.",
          "english": "I am a Business Informatics student at the University of Costa Rica, where I have had the opportunity to develop projects that stand out in my professional portfolio. Additionally, I have complemented my academic training with specialized courses on platforms like Udemy, allowing me to expand my knowledge and stay up-to-date with the latest technological trends. My passion for informatics and programming drives me to constantly explore new areas, particularly excelling in Frontend development and Cybersecurity. I have hands-on experience with a variety of technologies and languages, including JavaScript, Java, HTML, CSS, React, Ruby on Rails, SQL, and PostgreSQL. These skills have been honed through personal projects and a corporate internship, where I have actively contributed to creating innovative and functional technological solutions."
        }
      },
      {
        "id": "skillsTitle",
        "languages": {
          "spanish": "Aptitudes",
          "english": "Skills"
        }
      },
      {
        "id": "skillsDescription",
        "languages": {
          "spanish": "Estas son algunas de las tecnologías de las que tengo conocimientos",
          "english": "These are some of the technologies I have knowledge in"
        }
      },
      {
        "id": "courseTitle",
        "languages": {
          "spanish": "Educación",
          "english": "Education"
        }
      },
      {
        "id": "proyectsTitle",
        "languages": {
          "spanish": "Mis Proyectos",
          "english": "My Projects"
        }
      },
      {
        "id": "proyectTitle1",
        "languages": {
          "spanish": "Sistema de Gestion Financiera Ganadera",
          "english": "Livestock Financial Management System"
        }
      },
      {
        "id": "proyectTitle3",
        "languages": {
          "spanish": "Sistema de Controlador Windows Remoto",
          "english": "Remote Windows Controller System"
        }
      },
      {
        "id": "proyectTitle4",
        "languages": {
          "spanish": "Sistema de Validaciones Automatico y Adaptable JS y PHP",
          "english": "Automated and Adaptive Validation System JS and PHP"
        }
      },
      {
        "id": "proyectDes1",
        "languages": {
          "spanish": "Desarrollé un sistema integral para una empresa ganadera, donde asumí el rol de líder de proyecto, coordinando un equipo de 3 compañeros. Implementé la metodología SCRUM para optimizar el desarrollo ágil, utilizando Trello como herramienta para la gestión de tareas y organización de dos equipos: Frontend y Backend. Contribuí significativamente al desarrollo del Frontend utilizando React, creando interfaces dinámicas y funcionales que mejoraron la experiencia del usuario. Además, participé activamente en el desarrollo del Backend con Ruby on Rails, asegurando la integración fluida entre los componentes del sistema y cumpliendo con los estándares de calidad del proyecto.",
          "english": "I developed a comprehensive system for a livestock company, taking on the role of project leader and coordinating a team of 3 colleagues. I implemented the SCRUM methodology to optimize agile development, using Trello as a tool to manage tasks and organize two teams: Frontend and Backend. I made significant contributions to the Frontend development using React, creating dynamic and functional interfaces that enhanced the user experience. Additionally, I actively participated in Backend development with Ruby on Rails, ensuring seamless integration between system components and adhering to the project's quality standards."
        }
      },
      {
        "id": "proyectTitle2",
        "languages": {
          "spanish": "Space Invaders",
          "english": "Space Invaders"
        }
      },
      {
        "id": "proyectDes2",
        "languages": {
          "spanish": "Pequeño proyecto de SpaceInvaders como primer proyecto grande al que dedique mucho tiempo en Java.",
          "english": "Small Space Invaders project as my first major project that I dedicated a lot of time to in Java."
        }
      },
      {
        "id": "proyectDes3",
        "languages": {
          "spanish": "Un proyecto de desarrollo universitario que buscaba generar un controlador remoto utilizando .NET",
          "english": "A university development project that sought to generate a remote controller using .NET"
        }
      },
      {
        "id": "proyectDes4",
        "languages": {
          "spanish": "Este microservicio en JavaScript forma un sistema integral para validar datos antes de su envío al servidor. Se encarga de realizar una validación detallada en el lado del cliente, asegurando la corrección de los datos según una configuración definida en un archivo JSON. Las funciones JS están diseñadas para mapear y validar una variedad de campos de entrada, como tarjetas, contraseñas, botones de radio, opciones de checkbox y tablas dinámicas, proporcionando mensajes de error detallados. Además, se integra con una versión en PHP para realizar una validación adicional en el servidor después de la validación inicial en el lado del cliente. Esto añade una capa de seguridad adicional, garantizando que los datos cumplan con los requisitos antes de ser procesados por completo. Esta combinación de validaciones en el cliente y en el servidor asegura un control exhaustivo y robusto sobre los datos antes de su procesamiento final.",
          "english": "This JavaScript microservice forms a comprehensive system for validating data before it is sent to the server. It is responsible for performing detailed client-side validation, ensuring the correctness of the data according to a configuration defined in a JSON file. The JS functions are designed to map and validate a variety of input fields, such as cards, passwords, radio buttons, checkbox options and pivot tables, providing detailed error messages. In addition, it integrates with a PHP version to perform additional validation on the server after the initial client-side validation. This adds an additional layer of security, ensuring that the data is compliant before it is fully processed. This combination of client-side and server-side validation ensures thorough and robust control over the data before final processing."
                  
        }
      },
      {
        "id": "contactTitle",
        "languages": {
          "spanish": "Contactame",
          "english": "Contact me"
        }
      },
      {
        "id": "UCRTitle",
        "languages": {
          "spanish": "Bachillerato en Informatica Empresarial (TI)",
          "english": "Bachelor's Degree in Computer Science (IT)"
        }
      },
      {
        "id": "UCRDescription",
        "languages": {
          "spanish": "Bases de Datos, Manejo de Proyectos, Desarrollo Web, Programación Orientada a Objetos (POO), Redes",
          "english": "Databases, Project Management, Web Development, Object-Oriented Programming (OOP), Networking"
        }
      },
      {
        "id": "UdemyCurseMasterFramework",
        "languages": {
          "spanish": "Curso Frameworks JavaScript",
          "english": "JavaScript Frameworks Course"
        }
      },
      {
        "id": "HomeText",
        "languages": {
          "spanish": "Inicio",
          "english": "Home"
        }
      },
      {
        "id": "ProyectsText",
        "languages": {
          "spanish": "Proyectos",
          "english": "My Projects"
        }
      },
      {
        "id": "Skills",
        "languages": {
          "spanish": "Habilidades",
          "english": "Skills"
        }
      },
      {
        "id": "proyectTitle5",
        "languages": {
          "spanish": "Proyecto Wallet",
          "english": "Project Wallet"
        }
      },
      {
        "id": "proyectDes5",
        "languages": {
          "spanish": "Lideré el desarrollo de un sistema integral de gestión de Recursos Humanos diseñado para atender las necesidades de una o varias empresas del sector. Este proyecto incluyó la creación de una Wallet empresarial con diversas funcionalidades, utilizando frameworks modernos como NestJS para el Backend y NextJS para el Frontend, lo que permitió una arquitectura robusta, escalable y eficiente. Implementé una API altamente segura mediante el uso de tokens de acceso, asegurando la protección y privacidad de los datos sensibles. Las funcionalidades abarcan desde capacitaciones, gestión de pagos y proyección de trabajo futuro, hasta manejo de datos de empleados y un sistema de control a través de notificaciones en tiempo real. Además, desarrollé una aplicación móvil para complementar el ecosistema. Como principal desarrollador y líder del proyecto, fui responsable de coordinar equipos, tomar decisiones clave y garantizar el éxito de cada etapa del desarrollo.",
          "english": "I led the development of a comprehensive Human Resources management system designed to meet the needs of one or multiple companies in the HR sector. This project included the creation of an enterprise wallet with diverse functionalities, leveraging modern frameworks such as NestJS for the Backend and NextJS for the Frontend, enabling a robust, scalable, and efficient architecture. I implemented a highly secure API using access tokens, ensuring the protection and privacy of sensitive data. The system’s features range from training management, payment processing, and future work projections to employee data management and a real-time notification control system. Additionally, a mobile app was developed to complement the ecosystem. As the main developer and project leader, I was responsible for coordinating teams, making key decisions, and ensuring the success of every development stage."
        }
      },{
        "id": "proyectTitle6",
        "languages": {
          "spanish": "Detector Somnolencia",
          "english":  "Sleep Detector"
        }
      },
      {
        "id": "proyectDes6",
        "languages": {
          "spanish": "Un sistema de detección del sueño mediante Python, que utiliza la camara y una librería llamada dlib para detectar la presencia del sueño en una imagen y opencv-python para procesar las imagenes en tiempo real.",
          "english": "A sleep detection system using Python, which uses the camera and a library called dlib to detect the presence of sleep in an image and opencv-python to process images in real-time."
        }
      },{
        "id": "proyectTitle7",
        "languages": {
          "spanish": "Mellita Essentia Web Page",
          "english": "Mellita Essentia Web Page"
        }
      },
      {
        "id": "proyectDes7",
        "languages": {
          "spanish": "Desarrollé un proyecto para un negocio familiar dedicado a la venta de productos de belleza, creando una página web moderna y funcional con NextJS. La web fue desplegada de manera eficiente en Vercel, aprovechando su facilidad de implementación y escalabilidad. Además, integré DynamoDB de AWS como base de datos para garantizar un manejo seguro, rápido y confiable de los datos de los productos y pedidos. Este proyecto no solo optimizó la presencia digital del negocio, sino que también mejoró la experiencia del cliente al ofrecer una plataforma intuitiva y fácil de usar.",
          "english": "I developed a project for a family business dedicated to selling beauty products, creating a modern and functional website using NextJS. The site was efficiently deployed on Vercel, leveraging its ease of deployment and scalability. Additionally, I integrated AWS DynamoDB as the database to ensure secure, fast, and reliable handling of product and order data. This project not only optimized the business’s digital presence but also enhanced the customer experience by providing an intuitive and user-friendly platform."
        }
      },
      {
        "id": "proyectTitle8",
        "languages": {
          "spanish": "TalexaIA",
          "english": "TalexaAI"
        }
      },
      {
        "id": "proyectDes8",
        "languages": {
          "spanish": "Desarrollé una plataforma full-stack con Next.js (frontend) y Node.js (backend) que integra OpenAI para transformar consultas en lenguaje natural (ej: distribución salarial por departamento) en gráficos interactivos (Chart.js). Implementé pipelines de procesamiento de datos para garantizar cumplimiento GDPR, optimicé la renderización con Server-Side Rendering y diseñé una API REST para conexión segura a bases de datos internas. La herramienta procesa datos de HR y Pagos, reduciendo el tiempo de generación de reportes en un 60% mediante automatización con IA.",
          "english": " I developed a full-stack platform with Next.js (frontend) and Node.js (backend) that integrates OpenAI to transform natural language queries (e.g. salary distribution by department) into interactive charts (Chart.js). I implemented data processing pipelines to ensure GDPR compliance, optimized rendering with Server-Side Rendering, and designed a REST API for secure connection to internal databases. The tool processes HR and Payment data, reducing report generation time by 60% through AI automation."
        }
      }
    

    ]
  }
  