{
    "texts": [
      {
        "id": "welcomeTitle",
        "languages": {
          "spanish": "Hola Soy Orlando",
          "english": "Hello, I'm Orlando"
        }
      },
      {
        "id": "welcomeDescription",
        "languages": {
          "spanish": "Una persona altamente comprometida con deseos de aprender,  adquirir nuevas habilidades y experiencia profesional. Es un Junior en Full Stack con un año de experiencia, con un fuerte interés y pasión por el trabajo en el Frontend. Se siente atraído por la creación de interfaces de usuario atractivas y funcionales. Disfruto explorando las últimas tendencias y tecnologías en el desarrollo web. Mi objetivo es convertirse en un profesional completo en el desarrollo Full Stack, combinando sus habilidades en el Frontend y el Backend para crear aplicaciones web completas y de alto rendimiento.",
          "english": "A highly committed individual with a desire to learn, acquire new skills and professional experience. He is a Junior in Full Stack with one year of experience, with a strong interest and passion for Frontend work. You are attracted to creating attractive and functional user interfaces. He enjoys exploring the latest trends and technologies in web development. My goal is to become a complete professional in Full Stack development, combining your Frontend and Backend skills to create complete and high performance web applications."
        }
      },
      {
        "id": "aboutMeTitle",
        "languages": {
          "spanish": "Sobre mí",
          "english": "About Me"
        }
      },
      {
        "id": "aboutMeDescription",
        "languages": {
          "spanish": "Soy un estudiante de Informatica Empresarial en la Universidad de Costa Rica, en la cual he llegado a desarrollar diferentes proyectos de mi Portafolio. También he tomado algunos cursos externos a la Universidad, para desarrollar mi conocimiento en la plataforma de Udemy. Soy un apacionado de la Informatica y la programación siempre paso buscando temas nuevos y me gusta mucho el ambito del FrontEnd y la Cyberseguridad. Poseo experiencia en diversos ambitos y lenguajes como: JavaScript, Java, HTML, CSS, React, Ruby On Rails, SQL, Postgresql. La cúal he obtenido y mejorado gracias a una practica Empresarial en la que estoy a día de hoy.",
          "english": "I am a student of Business Informatics at the University of Costa Rica, where I have developed various projects for my Portfolio. I have also taken external courses to the University to develop my knowledge on the Udemy platform. I am passionate about Informatics and programming; I am always looking for new topics, and I particularly enjoy the FrontEnd and Cybersecurity fields. I have experience in various areas and languages such as JavaScript, Java, HTML, CSS, React, Ruby On Rails, SQL, and Postgresql, which I have obtained and improved through an internship I am currently engaged in."
        }
      },
      {
        "id": "skillsTitle",
        "languages": {
          "spanish": "Aptitudes",
          "english": "Skills"
        }
      },
      {
        "id": "skillsDescription",
        "languages": {
          "spanish": "Estas son algunas de las tecnologías de las que tengo conocimientos",
          "english": "These are some of the technologies I have knowledge in"
        }
      },
      {
        "id": "courseTitle",
        "languages": {
          "spanish": "Educación",
          "english": "Education"
        }
      },
      {
        "id": "proyectsTitle",
        "languages": {
          "spanish": "Mis Proyectos",
          "english": "My Projects"
        }
      },
      {
        "id": "proyectTitle1",
        "languages": {
          "spanish": "Sistema de Gestion Financiera Ganadera",
          "english": "Livestock Financial Management System"
        }
      },
      {
        "id": "proyectTitle3",
        "languages": {
          "spanish": "Sistema de Controlador Windows Remoto",
          "english": "Remote Windows Controller System"
        }
      },
      {
        "id": "proyectTitle4",
        "languages": {
          "spanish": "Sistema de Validaciones Automatico y Adaptable JS y PHP",
          "english": "Automated and Adaptive Validation System JS and PHP"
        }
      },
      {
        "id": "proyectDes1",
        "languages": {
          "spanish": "Sistema generado para una empresa ganadera, en la cual fui lider del proyecto, con 3 compañeros más. Maneje metodología de SCRUM utilizando Trello para el desarrollo y manejo de dos equipos en Front y Back End. Desarrolle gran parte del FrontEnd en React y estuve muy presente en el desarrollo de las tareas de BackEnd en Ruby On Rails.",
          "english": "System generated for a livestock company, where I was the project leader along with 3 other colleagues. I used SCRUM methodology, utilizing Trello for the development and management of two teams in Front and Back End. I developed a significant portion of the FrontEnd in React and was actively involved in the development of BackEnd tasks using Ruby On Rails."
        }
      },
      {
        "id": "proyectTitle2",
        "languages": {
          "spanish": "Space Invaders",
          "english": "Space Invaders"
        }
      },
      {
        "id": "proyectDes2",
        "languages": {
          "spanish": "Pequeño proyecto de SpaceInvaders como primer proyecto grande al que dedique mucho tiempo en Java.",
          "english": "Small Space Invaders project as my first major project that I dedicated a lot of time to in Java."
        }
      },
      {
        "id": "proyectDes3",
        "languages": {
          "spanish": "Un proyecto de desarrollo universitario que buscaba generar un controlador remoto utilizando .NET",
          "english": "A university development project that sought to generate a remote controller using .NET"
        }
      },
      {
        "id": "proyectDes4",
        "languages": {
          "spanish": "Este microservicio en JavaScript forma un sistema integral para validar datos antes de su envío al servidor. Se encarga de realizar una validación detallada en el lado del cliente, asegurando la corrección de los datos según una configuración definida en un archivo JSON. Las funciones JS están diseñadas para mapear y validar una variedad de campos de entrada, como tarjetas, contraseñas, botones de radio, opciones de checkbox y tablas dinámicas, proporcionando mensajes de error detallados. Además, se integra con una versión en PHP para realizar una validación adicional en el servidor después de la validación inicial en el lado del cliente. Esto añade una capa de seguridad adicional, garantizando que los datos cumplan con los requisitos antes de ser procesados por completo. Esta combinación de validaciones en el cliente y en el servidor asegura un control exhaustivo y robusto sobre los datos antes de su procesamiento final.",
          "english": "This JavaScript microservice forms a comprehensive system for validating data before it is sent to the server. It is responsible for performing detailed client-side validation, ensuring the correctness of the data according to a configuration defined in a JSON file. The JS functions are designed to map and validate a variety of input fields, such as cards, passwords, radio buttons, checkbox options and pivot tables, providing detailed error messages. In addition, it integrates with a PHP version to perform additional validation on the server after the initial client-side validation. This adds an additional layer of security, ensuring that the data is compliant before it is fully processed. This combination of client-side and server-side validation ensures thorough and robust control over the data before final processing."
                  
        }
      },
      {
        "id": "contactTitle",
        "languages": {
          "spanish": "Contactame",
          "english": "Contact me"
        }
      },
      {
        "id": "UCRTitle",
        "languages": {
          "spanish": "Bachillerato en Informatica Empresarial (TI)",
          "english": "Bachelor's Degree in Computer Science (IT)"
        }
      },
      {
        "id": "UCRDescription",
        "languages": {
          "spanish": "Bases de Datos, Manejo de Proyectos, Desarrollo Web, Programación Orientada a Objetos (POO), Redes",
          "english": "Databases, Project Management, Web Development, Object-Oriented Programming (OOP), Networking"
        }
      },
      {
        "id": "UdemyCurseMasterFramework",
        "languages": {
          "spanish": "Curso Frameworks JavaScript",
          "english": "JavaScript Frameworks Course"
        }
      },
      {
        "id": "HomeText",
        "languages": {
          "spanish": "Inicio",
          "english": "Home"
        }
      },
      {
        "id": "ProyectsText",
        "languages": {
          "spanish": "Proyectos",
          "english": "My Projects"
        }
      },
      {
        "id": "Skills",
        "languages": {
          "spanish": "Habilidades",
          "english": "Skills"
        }
      }

    ]
  }
  